СкладГП/src/InformationRegisters/ПоврежденныеПакеты/ПоврежденныеПакеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоврежденныеПакеты</name>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Фото</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеПовреждений</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВыгруженПУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Исправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пакет</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/InformationRegisters/ОстаткиПакетовНаСкладах/ОстаткиПакетовНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОстаткиПакетовНаСкладах</name>
  <resources>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Досок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ряд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/CommonModules/ПоврежденныеПакеты/Module.bsl
Функция ПакетПоврежден(Знач НомерПакета) Экспорт
	Если ТипЗнч(НомерПакета) = Тип("Строка") Тогда
		НомерПакета = Пакеты.ПолучитьИдентификаторПакетаПоСтроке(НомерПакета);	
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пакет", НомерПакета);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоврежденныеПакеты.Пакет КАК Пакет
	|ИЗ
	|	РегистрСведений.ПоврежденныеПакеты КАК ПоврежденныеПакеты
	|ГДЕ
	|	ПоврежденныеПакеты.Пакет = &Пакет";
	Возврат НЕ Запрос.Выполнить().Пустой()
КонецФУнкции

Процедура ЗаписатьЗаписьРегистра(стр) Экспорт
	МенеджерСвойств = РегистрыСведений.ПоврежденныеПакеты;
	
	НовСвойство = МенеджерСвойств.СоздатьМенеджерЗаписи();
	НовСвойство.Склад				 = ОбщегоНазначенияВызовСервераПовтИсп.Склад();
	НовСвойство.Пакет				 = стр.Пакет;
	НовСвойство.ИдентификаторЗаписи	 = стр.ИдентификаторЗаписи;
	
	НовСвойство.Прочитать();
	Если НовСвойство.Выбран() Тогда
		Возврат;
	Иначе
		НовСвойство.Склад				 = ОбщегоНазначенияВызовСервераПовтИсп.Склад();
		НовСвойство.Пакет				 = стр.Пакет;
		НовСвойство.ИдентификаторЗаписи	 = стр.ИдентификаторЗаписи;
		Фото  = "";
	КонецЕсли;
	
	НовСвойство.Комментарий			 = стр.Комментарий;

	НовСвойство.ДанныеПовреждений	 = стр.ДанныеПовреждений;
	НовСвойство.ВыгруженПУ			 = ИСТИНА;
	НовСвойство.Номер				 = стр.Номер;
	НовСвойство.ДатаОбнаружения		 = стр.ДатаОбнаружения;
	
	НовСвойство.Записать(ИСТИНА);
КонецПроцедуры 

Процедура ОчиститьУстаревшиеПоврежденные() Экспорт
	УстановитьПривилегированныйРежим(ИСТИНА);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоврежденныеПакеты.Пакет КАК Пакет,
	|	ПоврежденныеПакеты.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ОстаткиПакетовНаСкладах.Объем КАК Объем
	|ИЗ
	|	Константа.Склад КАК КонстантаСклад
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПоврежденныеПакеты КАК ПоврежденныеПакеты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОстаткиПакетовНаСкладах КАК ОстаткиПакетовНаСкладах
	|			ПО ПоврежденныеПакеты.Склад = ОстаткиПакетовНаСкладах.Склад
	|				И ПоврежденныеПакеты.Пакет = ОстаткиПакетовНаСкладах.НомерПакета
	|		ПО КонстантаСклад.Значение = ПоврежденныеПакеты.Склад
	|ГДЕ
	|	ОстаткиПакетовНаСкладах.Объем ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	УдаляемыеИд = Новый Массив;
	Пока Выборка.Следующий() Цикл
		УдаляемыеИд.Добавить(Выборка.ИдентификаторЗаписи);	
	КонецЦикла;
	Для Каждого м из УдаляемыеИд Цикл
		НЗ = РегистрыСведений.ПоврежденныеПакеты.СоздатьНаборЗаписей();
		НЗ.ОбменДанными.Загрузка = ИСТИНА;
		НЗ.ОбменДанными.Получатели.АвтоЗаполнение = ЛОЖЬ;
		НЗ.ОбменДанными.Получатели.Очистить();
		НЗ.Отбор.ИдентификаторЗаписи.Установить(м);
		НЗ.Записать(ИСТИНА);
	КонецЦикла;
КонецПроцедуры
